benchmarks/lora/definitive_results/results_extras/extract_max_achievable_throughput/qwen-2.5-7b-instruct/_/log_26601443.out
INFO 09-04 16:43:55 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=8281, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct', tokenizer=None, num_prompts=8192, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/finding_maximum/extract_max_achievable_throughput/qwen-2.5-7b-instruct/_', launch_server=True, server_args='--port=8281 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/qwen/qwen-2.5-7b-instruct" --max-num-seqs="2048" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching', server_init_time=1800, disable_log_stats=False, disable_loras_users=True, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset=None, synthetic_input_length=None, synthetic_output_length=None)
Server started
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8192      
Benchmark duration (s):                  190.31    
Total input tokens:                      1805281   
Total generated tokens:                  1608840   
Request throughput (req/s):              43.05     
Input token throughput (tok/s):          9486.13   
Output token throughput (tok/s):         8453.90   
---------------Time to First Token----------------
Mean TTFT (ms):                          75978.56  
Median TTFT (ms):                        74301.15  
P99 TTFT (ms):                           154504.38 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          93.37     
Median TPOT (ms):                        97.97     
P99 TPOT (ms):                           116.97    
---------------Inter-token Latency----------------
Mean ITL (ms):                           90.95     
Median ITL (ms):                         91.33     
P99 ITL (ms):                            124.01    
==================================================
Concurrent checker terminated
Server terminated